{
  "html": "<div class=\"section\">\n<h2>◆前回までのあらすじ</h2>\n<p>魔界歓楽街のサキュバスメイド喫茶《∞（インフィニティ）》で、新人テストエンジニアとして働く結城ユイ──源氏名ユイリア。場当たり運営で炎上しかけたオープン初夜、伝説のテストアーキテクト・神崎ナギに救われ、「テストは世界の見方を設計する仕事」だと知る。</p>\n<p>店の前を行き交う人々を観察し、仕様書の外側まで含めた世界 <span class=\"katex\">W</span> を意識するようになったユイは、ばらばらに見える客たちを同値クラスとしてまとめ、境界値分析で踏み込み方を整え、決定表で分岐の森を地図にし、状態遷移図で関係の変化を見通す力を磨いてきた。大イベント前にはペアワイズで「筋のいい組合せ」だけを選び、「全部は試せない」という賢いあきらめ方も学びつつある。</p>\n</div>\n<div class=\"section\">\n<h2>◆本編</h2>\n<p>イベント閉店後の《∞》は、嘘みたいに静かだった。さっきまで魔界 EDM が鳴り響き、社畜も観光客もカップルもごちゃまぜだったフロアが、今は片付いたテーブルとほのかな魔灯の明かりだけを残している。</p>\n<p>ユイリアはカウンター席で大きくため息をついた。目の前には今日のイベント用に自分で書いたテストケースノート。ページの端には「ペアワイズ OK」「境界△」「カズマさん来たら追加観察」と走り書きのメモが乱れている。</p>\n<div class=\"dialogue\">\n<span class=\"character-name\">ユイリア</span>\n                「一応、事故はなかったし……みんな楽しそうだった、よね」\n            </div>\n<p>つぶやきながらも、胸のあたりがざわざわして落ち着かない。何かを忘れている気がする。どこかに穴があって、明日突然そこから炎が噴き出すんじゃないか、みたいな感覚。</p>\n<div class=\"dialogue\">\n<span class=\"character-name\">神崎ナギ</span>\n                「顔に“テスト不安”って書いてあるよ」\n            </div>\n<p>振り向くと、いつの間にか神崎ナギがグラスに水を入れて座っていた。奥の厨房では、オーナーのバルハがしっぽで鍋を器用に運びながらこちらをちらりと見てニヤリと笑っている。</p>\n<p>ユイは観念して、ノートをぐるっと回してナギのほうに押し出した。</p>\n<div class=\"dialogue\">\n<span class=\"character-name\">ユイリア</span>\n                「今日、ペアワイズで組合せはかなり削れて……決定表も一応作って……境界っぽいところも、前に怒られたやつは踏み直して。でも、どこまでやれてるのか、全然わかんなくて。“まだ足りない気がする”って感覚だけが、ずっと残っちゃうんです」\n            </div>\n<p>ナギはノートをぱらぱらとめくり、ページの端に描かれた小さな丸や矢印を眺めながら、ふっと目を細めた。</p>\n<div class=\"dialogue\">\n<span class=\"character-name\">神崎ナギ</span>\n                「うん。いい顔してるよ、ユイ」\n            </div>\n<div class=\"dialogue\">\n<span class=\"character-name\">ユイリア</span>\n                「えっ、今にも泣きそうなんですけど」\n            </div>\n<div class=\"dialogue\">\n<span class=\"character-name\">神崎ナギ</span>\n                「『ここまではやった。でも、どこまで守れてるんだろう？』って、カバレッジを気にし始めた目だもん」\n            </div>\n<p>ナギはナプキンの裏に小さな七色の弧を描いた。</p>\n<div class=\"dialogue\">\n<span class=\"character-name\">神崎ナギ</span>\n                「テストで『どのくらい試せてる？』を考えるとき、私はよく虹を描く。網羅したいものを色で塗っていくイメージね」\n            </div>\n<p>弧には「機能」「組合せ」「境界」「役割」「時間帯」「デバイス」などのラベルが並ぶ。</p>\n<div class=\"dialogue\">\n<span class=\"character-name\">神崎ナギ</span>\n                「全部を同じ濃さで塗るのは無理。だから、今日みたいに組合せはペアワイズで薄めに、でも境界と役割は濃く塗る、とか、塗り分けを決める」\n            </div>\n<p>ユイは虹の欠けたところを指でなぞった。</p>\n<div class=\"dialogue\">\n<span class=\"character-name\">ユイリア</span>\n                「私、時間帯とデバイス、ほぼ塗ってないかも……」\n            </div>\n<div class=\"dialogue\">\n<span class=\"character-name\">神崎ナギ</span>\n                「じゃあ次の改善ポイントが見えたね。『虹のこの色は薄いけど、今回は許容する』『この色だけは濃く塗る』って自分で決めると、不安はだいぶ形になるよ」\n            </div>\n<p>ユイはノートの隅に、小さな虹を描き写す。「機能：濃」「境界：濃」「組合せ：中」「役割：中」「時間帯：薄」「デバイス：薄」。</p>\n<p>バルハが厨房から顔を出し、鍋をかき混ぜながら笑った。</p>\n<div class=\"dialogue\">\n<span class=\"character-name\">バルハ</span>\n                「虹、いいじゃない。うちの店も七色に光ってるんだし」\n            </div>\n<p>ユイはふっと笑う。不安は消えない。けれど、どの色をどこまで塗ったかを自分で説明できると思うと、胸のざわつきが少しだけ静まった。</p>\n<div class=\"dialogue\">\n<span class=\"character-name\">ユイリア</span>\n                「次のイベントでは、時間帯の色もちゃんと塗ってみます」\n            </div>\n<div class=\"dialogue\">\n<span class=\"character-name\">神崎ナギ</span>\n                「うん。虹は一晩じゃ完成しないからね。少しずつ重ねていこう」\n            </div>\n<p>虹色のメモをポケットにしまいながら、ユイは静かなフロアを見渡した。テストは終わらない。それでも、どの色を濃く塗るかを選べる自分が、少しだけ誇らしかった。</p>\n</div>",
  "id": "blk_9f76dc07de1f00b32476b10d8f3ca763a6a33d92",
  "type": "RawHtml"
}
